pdp7/openocd/contrib/loaders/flash/flm/cypress/psoc6/CY8C6xxx_SMIF/cy_smif/cy_smif.c
/***************************************************************************//**
* \file cy_smif.c
* \version 1.0
*
* \brief
*  This file provides the source code for the SMIF driver APIs.
*
* Note:
*
********************************************************************************
* \copyright
* Copyright 2016-2017, Cypress Semiconductor Corporation.  All rights reserved.
* You may use this file only in accordance with the license, terms, conditions,
* disclaimers, and limitations in the end user license agreement accompanying
* the software package with which this file was provided.
*******************************************************************************/

#include "cy_smif.h"

#if defined(__cplusplus)
extern "C" {
#endif

/*******************************************************************************
 * Function Name: Cy_SMIF_Init
 ****************************************************************************//**
*
* This function initializes the SMIF block as a communication block. The user
* must ensure that the SMIF interrupt is disabled while this function
* is called. Enabling the interrupts can lead to triggering in the middle
* of the initialization operation, which can lead to erroneous initialization.
*
* As parameters, this function takes the SMIF register base address and a
* context structure along with the configuration needed for the SMIF block,
* stored in a config
*
* \param base
* Holds the base address of the SMIF block registers.
*
* \param config
* Passes a configuration structure that configures the SMIF block for operation.
*
* \param context
* Passes a configuration structure that contains the transfer parameters of the
* SMIF block.
*
* \param timeout
* A timeout in microseconds for blocking APIs in use.
*
*
* \note Make sure that the interrupts are initialized and disabled.
*
* \return
*     - \ref CY_SMIF_BAD_PARAM
*     - \ref CY_SMIF_SUCCESS
*
*******************************************************************************/
cy_en_smif_status_t Cy_SMIF_Init(SMIF_Type *base, cy_stc_smif_config_t const *config, uint32_t timeout,
								 cy_stc_smif_context_t *context) {
	cy_en_smif_status_t result = CY_SMIF_BAD_PARAM;

	if ((NULL != base) && (NULL != config) && (NULL != context)) {
		/* Copy the base address of the SMIF and the SMIF Device block
		 * registers to the context.
		 */
		context->timeout = timeout;

		/* Configure the initial interrupt mask */
		/* Disable the TR_TX_REQ and TR_RX_REQ interrupts */
		Cy_SMIF_SetInterruptMask(base,
								 Cy_SMIF_GetInterruptMask(base) & ~(SMIF_INTR_TR_TX_REQ_Msk | SMIF_INTR_TR_RX_REQ_Msk));

		/* Configure the SMIF interface */
		base->CTL = (uint32_t)(
			_VAL2FLD(SMIF_CTL_XIP_MODE, config->mode) | _VAL2FLD(SMIF_CTL_CLOCK_IF_RX_SEL, config->rxClockSel) |
			_VAL2FLD(SMIF_CTL_DESELECT_DELAY, config->deselectDelay) | _VAL2FLD(SMIF_CTL_BLOCK, config->blockEvent));

		/* Read the register to flush the buffer */
		(void)base->CTL;

		result = CY_SMIF_SUCCESS;
	}

	return result;
}

/*******************************************************************************
 * Function Name: Cy_SMIF_DeInit
 ****************************************************************************//**
*
* This function de-initializes the SMIF block to default values.
*
* \param base
* Holds the base address of the SMIF block registers.
*
* \note The SMIF must be disabled before calling the function. Call
*  \ref Cy_SMIF_Disable
*
*******************************************************************************/
void Cy_SMIF_DeInit(SMIF_Type *base) {
	uint32_t idx;

	/* Configure the SMIF interface to default values.
	 * The default value is 0.
	 */
	base->CTL = CY_SMIF_CTL_REG_DEFAULT;
	base->TX_DATA_FIFO_CTL = 0U;
	base->RX_DATA_FIFO_CTL = 0U;
	base->INTR_MASK = 0U;
	for (idx = 0UL; idx < SMIF_DEVICE_NR; idx++) {
		base->DEVICE[idx].CTL = 0U;

		/* Read the register to flush the buffer */
		(void)base->DEVICE[idx].CTL;
	}
}

/*******************************************************************************
 * Function Name: Cy_SMIF_SetMode
 ****************************************************************************//**
*
* Sets the mode of operation for the SMIF. The mode of operation can be the XIP
* mode where the slave devices are mapped as memories and are directly accessed
* from the PSoC register map. In the MMIO mode, the SMIF block acts as a simple
* SPI engine.
*
* \note Interrupt and triggers and not working in XIP mode, see TRM for details
*
* \param base
* Holds the base address of the SMIF block registers.
*
* \param mode
* The mode of the SMIF operation.
*
*******************************************************************************/
void Cy_SMIF_SetMode(SMIF_Type *base, cy_en_smif_mode_t mode) {
	/*  Set the register SMIF.CTL.XIP_MODE = TRUE */
	if (CY_SMIF_NORMAL == mode) {
		base->CTL &= ~SMIF_CTL_XIP_MODE_Msk;
	} else {
		base->CTL |= SMIF_CTL_XIP_MODE_Msk;
	}

	/* Read the register to flush the buffer */
	(void)base->CTL;
}

/*******************************************************************************
 * Function Name: Cy_SMIF_GetMode
 ****************************************************************************//**
*
* Reads the mode of operation for the SMIF. The mode of operation can be the
* XIP mode where the slave devices are mapped as memories and are directly
* accessed from the PSoC register map. In the MMIO mode, the SMIF block acts as
* a simple SPI engine.
*
* \param base
* Holds the base address of the SMIF block registers.
*
* \return The mode of SMIF operation (see \ref cy_en_smif_mode_t).
*
*******************************************************************************/
cy_en_smif_mode_t Cy_SMIF_GetMode(SMIF_Type const *base) {
	cy_en_smif_mode_t result = CY_SMIF_NORMAL;

	/* Read the register SMIF.CTL.XIP_MODE*/
	if (0U != (base->CTL & SMIF_CTL_XIP_MODE_Msk)) {
		result = CY_SMIF_MEMORY;
	}

	return (result);
}

/*******************************************************************************
 * Function Name: Cy_SMIF_SetDataSelect
 ****************************************************************************//**
*
* This function configures the data select option for a specific slave. The
* selection provides pre-set combinations for connecting the SMIF data lines to
* the GPIOs.
*
* \param base
* Holds the base address of the SMIF block registers.
*
* \param slaveSelect
* The slave device ID. This number is either CY_SMIF_SLAVE_SELECT_0 or
* CY_SMIF_SLAVE_SELECT_1 or CY_SMIF_SLAVE_SELECT_2 or CY_SMIF_SLAVE_SELECT_3
* (\ref cy_en_smif_slave_select_t). It defines the slave select line to be used
* during the transmission.
*
* \param dataSelect
* This parameter selects the data select option. \ref cy_en_smif_data_select_t
*
*******************************************************************************/
void Cy_SMIF_SetDataSelect(SMIF_Type *base, cy_en_smif_slave_select_t slaveSelect,
						   cy_en_smif_data_select_t dataSelect) {
	SMIF_DEVICE_Type volatile *device;
	/* Connect the slave to its data lines */
	device = Cy_SMIF_GetDeviceBySlot(base, slaveSelect);

	if (NULL != device) {
		device->CTL = _CLR_SET_FLD32U(device->CTL, SMIF_DEVICE_CTL_DATA_SEL, (uint32_t)dataSelect);

		/* Read the register to flush the buffer */
		(void)device->CTL;
	}
}

