pdp7/openocd/contrib/loaders/flash/flm/cypress/psoc6/CY8C6xxx_SMIF/cy_smif/cy_smif.c
/*******************************************************************************
 * Function Name: Cy_SMIF_TransmitCommand()
 ****************************************************************************//**
*
* This function transmits a command byte followed by a parameter which is
* typically an address field. The transfer is implemented using the TX FIFO.
* This function also asserts the slave select line.
* A command to a memory device generally starts with a command byte
* transmission. This function sets up the slave lines for the rest of the
* command structure. The \ref Cy_SMIF_TransmitCommand is called before \ref
* Cy_SMIF_TransmitData or \ref Cy_SMIF_ReceiveData is called. When enabled, the
* cmpltTxfr parameter in the function will de-assert the slave select line at
* the end of the function execution.
*
* \note This function blocks until all the command and associated parameters
* have been transmitted over the SMIF block or timeout expire.
*
* \param base
* Holds the base address of the SMIF block registers.
*
* \param cmd
* The command byte to be transmitted.
*
* \param cmdTxfrWidth
* The width of command byte transfer \ref cy_en_smif_txfr_width_t.
*
* \param cmdParam
* This is the pointer to an array that has bytes to be transmitted
* after the command byte. Typically, this field has the address bytes
* associated with the memory command.
*
* \param paramSize
* The size of the cmdParam array.
*
* \param paramTxfrWidth
* The width of parameter transfer \ref cy_en_smif_txfr_width_t.
*
* \param slaveSelect
* Denotes the number of the slave device to which the transfer is made.
* (0, 1, 2 or 4 - the bit defines which slave to enable) Two-bit enable is
* possible only for the Double Quad SPI mode.
*
* \param cmpltTxfr
* Specifies if the slave select line must be de-asserted after transferring
* the last byte in the parameter array. Typically, this field is set to 0 when
* this function succeed through \ref Cy_SMIF_TransmitData or \ref
* Cy_SMIF_ReceiveData.
*
* \param context
* Passes a configuration structure that contains the transfer parameters of the
* SMIF block.
*
* \return A status of the command transmit.
*       - \ref CY_SMIF_SUCCESS
*       - \ref CY_SMIF_EXCEED_TIMEOUT
*
*******************************************************************************/
cy_en_smif_status_t Cy_SMIF_TransmitCommand(SMIF_Type *base, uint8_t cmd, cy_en_smif_txfr_width_t cmdTxfrWidth,
											uint8_t const cmdParam[], uint32_t paramSize,
											cy_en_smif_txfr_width_t paramTxfrWidth,
											cy_en_smif_slave_select_t slaveSelect, uint32_t cmpltTxfr,
											cy_stc_smif_context_t const *context) {
	/* The return variable */
	cy_en_smif_status_t result = CY_SMIF_SUCCESS;

	uint8_t bufIndex = 0U;
	/* The common part of a command and parameter transfer */
	uint32_t const constCmdPart =
		(_VAL2FLD(CY_SMIF_CMD_FIFO_WR_MODE, CY_SMIF_CMD_FIFO_TX_MODE) | _VAL2FLD(CY_SMIF_CMD_FIFO_WR_SS, slaveSelect));
	uint32_t timeoutUnits = context->timeout;

	/* Send the command byte */
	base->TX_CMD_FIFO_WR = constCmdPart | _VAL2FLD(CY_SMIF_CMD_FIFO_WR_WIDTH, (uint32_t)cmdTxfrWidth) |
						   _VAL2FLD(CY_SMIF_CMD_FIFO_WR_TXDATA, (uint32_t)cmd) |
						   _VAL2FLD(CY_SMIF_CMD_FIFO_WR_LAST_BYTE, ((0UL == paramSize) ? cmpltTxfr : 0UL));

	/* Send the command parameters (usually address) in the blocking mode */
	while ((bufIndex < paramSize) && (CY_SMIF_EXCEED_TIMEOUT != result)) {
		/* Check if there is at least one free entry in TX_CMD_FIFO */
		if (Cy_SMIF_GetCmdFifoStatus(base) < CY_SMIF_TX_CMD_FIFO_STATUS_RANGE) {
			base->TX_CMD_FIFO_WR =
				constCmdPart | _VAL2FLD(CY_SMIF_CMD_FIFO_WR_TXDATA, (uint32_t)cmdParam[bufIndex]) |
				_VAL2FLD(CY_SMIF_CMD_FIFO_WR_WIDTH, (uint32_t)paramTxfrWidth) |
				_VAL2FLD(CY_SMIF_CMD_FIFO_WR_LAST_BYTE, ((((uint32_t)bufIndex + 1UL) < paramSize) ? 0UL : cmpltTxfr));

			bufIndex++;
		}
		result = Cy_SMIF_TimeoutRun(&timeoutUnits);
	}

	return (result);
}

/*******************************************************************************
 * Function Name: Cy_SMIF_TransmitData
 ****************************************************************************//**
*
* This function is used to transmit data using the SMIF interface. This
* function uses the TX Data FIFO to implement the transmit functionality. The
* function sets up an interrupt to trigger the TX Data FIFO and uses that
* interrupt to fill the TX Data FIFO until all the data is transmitted. At the
* end of the transmission, the TxCmpltCb is executed.
*
* \note  This function is to be preceded by \ref Cy_SMIF_TransmitCommand where
* the slave select is selected. The slave is de-asserted at the end of a
* transmit. The function triggers the transfer and the transfer itself utilizes
* the interrupt for FIFO operations in the background. Thus, frequent
* interrupts will be executed after this function is triggered.
* Since this API is non-blocking and sets up the interrupt to act on the data
* FIFO, ensure there will be no another instance of the function called
* before the current instance has completed execution.
*
* \param base
* Holds the base address of the SMIF block registers.
*
* \param context
* Passes a configuration structure that contains the transfer parameters of the
* SMIF block.
*
* \param txBuffer
* The pointer to the data to be transferred. If this pointer is a NULL, then the
* function does not enable the interrupt. This use case is typically used when
* the FIFO is handled outside the interrupt and is managed in either a
* polling-based code or a DMA. The user would handle the FIFO management in a
* DMA or a polling-based code.
*
* \note If the user provides a NULL pointer in this function and does not handle
* the FIFO transaction, this could either stall or timeout the operation.
* The transfer statuses returned by \ref Cy_SMIF_GetTxfrStatus are no longer
* valid.
*
* \param size
* The size of txBuffer. Must be > 0.
*
* \param transferWidth
* The width of transfer \ref cy_en_smif_txfr_width_t.
*
* \param TxCmpltCb
* The callback executed at the end of a transmission. NULL interpreted as no
* callback.
*
* \return A status of a transmission.
*       - \ref CY_SMIF_SUCCESS
*       - \ref CY_SMIF_CMD_FIFO_FULL
*       - \ref CY_SMIF_BAD_PARAM
*
*******************************************************************************/
cy_en_smif_status_t Cy_SMIF_TransmitData(SMIF_Type *base, uint8_t *txBuffer, uint32_t size,
										 cy_en_smif_txfr_width_t transferWidth, cy_smif_event_cb_t TxCmpltCb,
										 cy_stc_smif_context_t *context) {
	/* The return variable */
	cy_en_smif_status_t result = CY_SMIF_BAD_PARAM;

	if (size > 0U) {
		result = CY_SMIF_CMD_FIFO_FULL;
		/* Check if there are enough free entries in TX_CMD_FIFO */
		if (Cy_SMIF_GetCmdFifoStatus(base) < CY_SMIF_TX_CMD_FIFO_STATUS_RANGE) {
			/* Enter the transmitting mode */
			base->TX_CMD_FIFO_WR = _VAL2FLD(CY_SMIF_CMD_FIFO_WR_MODE, CY_SMIF_CMD_FIFO_TX_COUNT_MODE) |
								   _VAL2FLD(CY_SMIF_CMD_FIFO_WR_WIDTH, (uint32_t)transferWidth) |
								   _VAL2FLD(CY_SMIF_CMD_FIFO_WR_TX_COUNT, ((uint32_t)(size - 1U)));

			if (NULL != txBuffer) {
				/* Move the parameters to the global variables */
				context->txBufferAddress = (uint8_t *)txBuffer;
				context->txBufferSize = size;
				context->txBufferCounter = size;
				context->txCmpltCb = TxCmpltCb;
				context->transferStatus = (uint32_t)CY_SMIF_SEND_BUSY;

