pdp7/openocd/contrib/loaders/flash/flm/cypress/psoc6/CY8C6xxx_SMIF/cy_smif/cy_smif.c
				/* Enable the TR_TX_REQ interrupt */
				Cy_SMIF_SetInterruptMask(base, Cy_SMIF_GetInterruptMask(base) | SMIF_INTR_TR_TX_REQ_Msk);
			}
			result = CY_SMIF_SUCCESS;
		}
	}

	return (result);
}

/*******************************************************************************
 * Function Name: Cy_SMIF_TransmitDataBlocking
 ****************************************************************************//**
*
* This function implements the transmit data phase in the memory command. The
* data is transmitted using the Tx Data FIFO and the TX_COUNT command. This
* function blocks until completion. The function does not use the interrupts and
* will use CPU to monitor the FIFO status and move data accordingly. The
* function returns only on completion.
*
* \note  Since this API is blocking, ensure that other transfers finished and it
* will not be called during non-blocking transfer.
*
* \param base
* Holds the base address of the SMIF block registers.
*
* \param context
* Passes a configuration structure that contains the transfer parameters of the
* SMIF block.
*
* \param txBuffer
* The pointer to the data to be transferred. If this pointer is a NULL, then the
* function does not fill TX_FIFO. The user would handle the FIFO management in a
* DMA or a polling-based code.
*
* \note If the user provides a NULL pointer in this function and does not handle
* the FIFO transaction, this could either stall or timeout the operation.
* The transfer statuses returned by \ref Cy_SMIF_GetTxfrStatus are no longer
* valid.
*
* \param size
* The size of txBuffer. Must be > 0.
*
* \param transferWidth
* The width of transfer \ref cy_en_smif_txfr_width_t.
*
* \return A status of a transmission.
*       - \ref CY_SMIF_SUCCESS
*       - \ref CY_SMIF_CMD_FIFO_FULL
*       - \ref CY_SMIF_EXCEED_TIMEOUT
*       - \ref CY_SMIF_BAD_PARAM
*
*******************************************************************************/
cy_en_smif_status_t Cy_SMIF_TransmitDataBlocking(SMIF_Type *base, uint8_t *txBuffer, uint32_t size,
												 cy_en_smif_txfr_width_t transferWidth,
												 cy_stc_smif_context_t const *context) {
	/* The return variable */
	cy_en_smif_status_t result = CY_SMIF_BAD_PARAM;

	if (size > 0U) {
		result = CY_SMIF_CMD_FIFO_FULL;
		/* Check if there are enough free entries in TX_CMD_FIFO */
		if (Cy_SMIF_GetCmdFifoStatus(base) < CY_SMIF_TX_CMD_FIFO_STATUS_RANGE) {
			/* Enter the transmitting mode */
			base->TX_CMD_FIFO_WR = _VAL2FLD(CY_SMIF_CMD_FIFO_WR_MODE, CY_SMIF_CMD_FIFO_TX_COUNT_MODE) |
								   _VAL2FLD(CY_SMIF_CMD_FIFO_WR_WIDTH, (uint32_t)transferWidth) |
								   _VAL2FLD(CY_SMIF_CMD_FIFO_WR_TX_COUNT, ((uint32_t)(size - 1U)));

			result = CY_SMIF_SUCCESS;

			if (NULL != txBuffer) {
				uint32_t timeoutUnits = context->timeout;
				cy_stc_smif_context_t contextLoc;

				/* initialize parameters for Cy_SMIF_PushTxFifo */
				contextLoc.txBufferAddress = (uint8_t *)txBuffer;
				contextLoc.txBufferCounter = size;
				contextLoc.txCmpltCb = NULL;
				contextLoc.transferStatus = (uint32_t)CY_SMIF_SEND_BUSY;

				while (((uint32_t)CY_SMIF_SEND_BUSY == contextLoc.transferStatus) &&
					   (CY_SMIF_EXCEED_TIMEOUT != result)) {
					Cy_SMIF_PushTxFifo(base, &contextLoc);
					result = Cy_SMIF_TimeoutRun(&timeoutUnits);
				}
			}
		}
	}

	return (result);
}

/*******************************************************************************
 * Function Name: Cy_SMIF_ReceiveData
 ****************************************************************************//**
*
* This function implements the receive data phase in the memory command. The
* data is received into the RX Data FIFO using the RX_COUNT command. This
* function sets up the interrupt to trigger on the RX Data FIFO level, and the
* data is fetched from the RX Data FIFO to the rxBuffer as it gets filled. This
* function does not block until completion. The completion will trigger the call
* back function.
*
* \note This function is to be preceded by \ref Cy_SMIF_TransmitCommand. The
* slave select is de-asserted at the end of the receive.
* The function triggers the transfer and the transfer itself utilizes the
* interrupt for FIFO operations in the background. Thus, frequent
* interrupts will be executed after this function is triggered.
* This API is non-blocking and sets up the interrupt to act on the data
* FIFO, ensure there will be no another instance of the function called
* before the current instance has completed execution.
*
*
* \param base
* Holds the base address of the SMIF block registers.
*
* \param context
* Passes a configuration structure that contains the transfer parameters of the
* SMIF block.
*
* \param rxBuffer
* The pointer to the variable where the receive data is stored. If this pointer
* is a NULL, then the function does not enable the interrupt. This use case is
* typically used when the FIFO is handled outside the interrupt and is managed
* in either a polling-based code or a DMA. The user would handle the FIFO
* management in a DMA or a polling-based code.
*
* \note If the user provides a NULL pointer in this function and does not handle
* the FIFO transaction, this could either stall or timeout the operation.
* The transfer statuses returned by \ref Cy_SMIF_GetTxfrStatus are no longer
* valid.
*
* \param size
* The size of data to be received. Must be > 0.
*
* \param transferWidth
* The width of transfer \ref cy_en_smif_txfr_width_t.
*
* \param RxCmpltCb
* The callback executed at the end of a reception. NULL interpreted as no
* callback.
*
* \return A status of a reception.
*       - \ref CY_SMIF_SUCCESS
*       - \ref CY_SMIF_CMD_FIFO_FULL
*       - \ref CY_SMIF_BAD_PARAM
*
*******************************************************************************/
cy_en_smif_status_t Cy_SMIF_ReceiveData(SMIF_Type *base, uint8_t *rxBuffer, uint32_t size,
										cy_en_smif_txfr_width_t transferWidth, cy_smif_event_cb_t RxCmpltCb,
										cy_stc_smif_context_t *context) {
	/* The return variable */
	cy_en_smif_status_t result = CY_SMIF_BAD_PARAM;

	if (size > 0U) {
		result = CY_SMIF_CMD_FIFO_FULL;
		/* Check if there are enough free entries in TX_CMD_FIFO */
		if (Cy_SMIF_GetCmdFifoStatus(base) < CY_SMIF_TX_CMD_FIFO_STATUS_RANGE) {
			/* Enter the receiving mode */
			base->TX_CMD_FIFO_WR = _VAL2FLD(CY_SMIF_CMD_FIFO_WR_MODE, CY_SMIF_CMD_FIFO_RX_COUNT_MODE) |
								   _VAL2FLD(CY_SMIF_CMD_FIFO_WR_WIDTH, (uint32_t)transferWidth) |
								   _VAL2FLD(CY_SMIF_CMD_FIFO_WR_RX_COUNT, ((uint32_t)(size - 1U)));

