pdp7/openocd/contrib/loaders/flash/flm/cypress/psoc6/CY8C6xxx_SMIF/cy_smif/cy_smif.c
			if (NULL != rxBuffer) {
				/* Move the parameters to the global variables */
				context->rxBufferAddress = (uint8_t *)rxBuffer;
				context->rxBufferSize = size;
				context->rxBufferCounter = size;
				context->rxCmpltCb = RxCmpltCb;
				context->transferStatus = (uint32_t)CY_SMIF_REC_BUSY;

				/* Enable the TR_RX_REQ interrupt */
				Cy_SMIF_SetInterruptMask(base, Cy_SMIF_GetInterruptMask(base) | SMIF_INTR_TR_RX_REQ_Msk);
			}
			result = CY_SMIF_SUCCESS;
		}
	}

	return (result);
}

/*******************************************************************************
 * Function Name: Cy_SMIF_ReceiveDataBlocking
 ****************************************************************************//**
*
* This function implements the receive data phase in the memory command. The
* data is received into the RX Data FIFO using the RX_COUNT command. This
* function blocks until completion. The function does not use the interrupts and
* will use CPU to monitor the FIFO status and move data accordingly. The
* function returns only on completion.
*
* \note This function is to be preceded by \ref Cy_SMIF_TransmitCommand. The
* slave select is de-asserted at the end of the receive. Ensure there is
* no another transfers.
*
* \param base
* Holds the base address of the SMIF block registers.
*
* \param context
* Passes a configuration structure that contains the transfer parameters of the
* SMIF block.
*
* \param rxBuffer
* The pointer to the variable where the receive data is stored. If this pointer
* is a NULL, then the function does not enable the interrupt. This use case is
* typically used when the FIFO is handled outside the interrupt and is managed
* in either a polling-based code or a DMA. The user would handle the FIFO
* management in a DMA or a polling-based code.
*
* \note If the user provides a NULL pointer in this function and does not handle
* the FIFO transaction, this could either stall or timeout the operation.
* The transfer statuses returned by \ref Cy_SMIF_GetTxfrStatus are no longer
* valid.
*
* \param size
* The size of data to be received. Must be > 0.
*
* \param transferWidth
* The width of transfer \ref cy_en_smif_txfr_width_t.
*
* \return A status of a reception.
*       - \ref CY_SMIF_SUCCESS
*       - \ref CY_SMIF_CMD_FIFO_FULL
*       - \ref CY_SMIF_EXCEED_TIMEOUT
*       - \ref CY_SMIF_BAD_PARAM
*
*******************************************************************************/
cy_en_smif_status_t Cy_SMIF_ReceiveDataBlocking(SMIF_Type *base, uint8_t *rxBuffer, uint32_t size,
												cy_en_smif_txfr_width_t transferWidth,
												cy_stc_smif_context_t const *context) {
	/* The return variable */
	cy_en_smif_status_t result = CY_SMIF_BAD_PARAM;

	if (size > 0U) {
		result = CY_SMIF_CMD_FIFO_FULL;
		/* Check if there are enough free entries in TX_CMD_FIFO */
		if (Cy_SMIF_GetCmdFifoStatus(base) < CY_SMIF_TX_CMD_FIFO_STATUS_RANGE) {
			/* Enter the receiving mode */
			base->TX_CMD_FIFO_WR = _VAL2FLD(CY_SMIF_CMD_FIFO_WR_MODE, CY_SMIF_CMD_FIFO_RX_COUNT_MODE) |
								   _VAL2FLD(CY_SMIF_CMD_FIFO_WR_WIDTH, (uint32_t)transferWidth) |
								   _VAL2FLD(CY_SMIF_CMD_FIFO_WR_RX_COUNT, ((uint32_t)(size - 1U)));
			result = CY_SMIF_SUCCESS;

			if (NULL != rxBuffer) {
				uint32_t timeoutUnits = context->timeout;
				cy_stc_smif_context_t contextLoc;

				/* initialize parameters for Cy_SMIF_PushTxFifo */
				contextLoc.rxBufferAddress = (uint8_t *)rxBuffer;
				contextLoc.rxBufferCounter = size;
				contextLoc.rxCmpltCb = NULL;
				contextLoc.transferStatus = (uint32_t)CY_SMIF_REC_BUSY;

				while (((uint32_t)CY_SMIF_REC_BUSY == contextLoc.transferStatus) &&
					   (CY_SMIF_EXCEED_TIMEOUT != result)) {
					Cy_SMIF_PopRxFifo(base, &contextLoc);
					result = Cy_SMIF_TimeoutRun(&timeoutUnits);
				}
			}
		}
	}
	return (result);
}

/*******************************************************************************
 * Function Name: Cy_SMIF_SendDummyCycles()
 ****************************************************************************//**
*
* This function sends dummy-clock cycles. The data lines are tri-stated during
* the dummy cycles.
*
* \note This function is to be preceded by \ref Cy_SMIF_TransmitCommand.
*
* \param base
* Holds the base address of the SMIF block registers.
*
* \param cycles
* The number of dummy cycles.
*
* \return A status of dummy cycles sending.
*       - \ref CY_SMIF_SUCCESS
*       - \ref CY_SMIF_CMD_FIFO_FULL
*
*******************************************************************************/
cy_en_smif_status_t Cy_SMIF_SendDummyCycles(SMIF_Type *base, uint32_t cycles) {
	/* The return variable */
	cy_en_smif_status_t result = CY_SMIF_CMD_FIFO_FULL;

	/* Check if there are enough free entries in TX_CMD_FIFO */
	if (Cy_SMIF_GetCmdFifoStatus(base) < CY_SMIF_TX_CMD_FIFO_STATUS_RANGE) {
		/* Send the dummy bytes */
		base->TX_CMD_FIFO_WR = _VAL2FLD(CY_SMIF_CMD_FIFO_WR_MODE, CY_SMIF_CMD_FIFO_DUMMY_COUNT_MODE) |
							   _VAL2FLD(CY_SMIF_CMD_FIFO_WR_DUMMY, ((uint32_t)(cycles - 1U)));

		result = CY_SMIF_SUCCESS;
	}

	return (result);
}

/*******************************************************************************
 * Function Name: Cy_SMIF_GetTxfrStatus
 ****************************************************************************//**
*
* This function provides the status of the transfer. This function is used to
* poll for the status of the TransmitData or receiveData function. When this
* function is called to determine the status of ongoing
* \ref Cy_SMIF_ReceiveData() or \ref Cy_SMIF_TransmitData(), the returned status
* is only valid if the functions passed a non-NULL buffer to transmit or
* receive respectively. If the pointer passed to \ref Cy_SMIF_ReceiveData()
* or \ref Cy_SMIF_TransmitData() is a NULL, then the code/DMA outside this
* driver will take care of the transfer and the Cy_GetTxfrStatus() will return
* an erroneous result.
*
* \param base
* Holds the base address of the SMIF block registers.
*
* \param context
* Passes a configuration structure that contains the transfer parameters of the
* SMIF block.
*
* \return Returns the transfer status. \ref cy_en_smif_txfr_status_t
*
*******************************************************************************/
uint32_t Cy_SMIF_GetTxfrStatus(SMIF_Type *base, cy_stc_smif_context_t const *context) {
	return (context->transferStatus);
}

