pdp7/openocd/contrib/loaders/flash/flm/cypress/psoc6/CY8C6xxx_SMIF/cy_smif/cy_smif.c
/*******************************************************************************
 * Function Name: Cy_SMIF_Enable
 ****************************************************************************//**
*
* Enables the operation of the SMIF block.
*
* \note This function only enables the SMIF IP. The interrupts associated with
* the SMIF will need to be separately enabled using the interrupt driver.
*
* \param base
* Holds the base address of the SMIF block registers.
*
* \param context
* Passes a configuration structure that contains the transfer parameters of the
* SMIF block.
*
*******************************************************************************/
void Cy_SMIF_Enable(SMIF_Type *base, cy_stc_smif_context_t *context) {
	/* Global variables initialization */
	context->txBufferAddress = 0U;
	context->txBufferSize = 0U;
	context->txBufferCounter = 0U;
	context->rxBufferAddress = 0U;
	context->rxBufferSize = 0U;
	context->rxBufferCounter = 0U;
	context->transferStatus = (uint32_t)CY_SMIF_STARTED;

	base->CTL |= SMIF_CTL_ENABLED_Msk;

	/* Read the register to flush the buffer */
	(void)base->CTL;
}

/*******************************************************************************
 * Function Name: Cy_SMIF_Encrypt()
 ****************************************************************************//**
*
* Uses the Encryption engine to create an encrypted result when the input, key
* and data arrays are provided. The AES-128 encryption of the address with the
* key, fetching the result and XOR with the data array are all done in the
* function. The operational scheme is the following:
*                   data = XOR(AES128(address, key), data)
* Decryption is done using the input data-array identically to the encryption.
* In the XIP mode, encryption and decryption are done without calling this
* function. The operational scheme in the XIP mode is the same. The address
* parameter in the XIP mode equals the actual address in the PSoC memory map.
* The SMIF encryption engine is designed for code storage.
* For data storage, the encryption key can be changed.
* For sensitive data, the Crypto block is used.
*
* \note The API does not have access to the encryption key. The key must be
* placed in the register before calling this API. The crypto routine
* that can access the key storage area is recommended. This crypto routine is
* typically a protection context 0 function.
*
* \note This is a blocking API. The API waits for encryption completion. Will
* exit if a timeout is set (not equal to 0) and expired.
*
* \param base
* Holds the base address of the SMIF block registers.
*
* \param context
* Passes a configuration structure that contains the transfer parameters of the
* SMIF block.
*
* \param address
* The address that gets encrypted is a masked 16-byte block address. The 32-bit
* address with the last 4 bits masked is placed as the last 4 bytes in the
* 128-bit input. The rest of the higher bit for the 128 bits are padded zeros.
* PA[127:0]:
* PA[3:0] = 0
* PA[7:4] = ADDR[7:4].
* PA[15:8] = ADDR[15:8].
* PA[23:16] = ADDR[23:16].
* PA[31:24] = ADDR[31:24].
* The other twelve of the sixteen plain text address bytes of PA[127:0] are "0":
* PA[127:32] = "0".
*
* \param data
* This is the location where the input data-array is passed while the function
* is called. This array gets populated with the result after encryption is
* completed.
*
* \param size
* Provides a size of the array.
*
* \return A status of the command transmit.
*       - \ref CY_SMIF_SUCCESS
*       - \ref CY_SMIF_EXCEED_TIMEOUT
*       - \ref CY_SMIF_BAD_PARAM
*
*******************************************************************************/
cy_en_smif_status_t Cy_SMIF_Encrypt(SMIF_Type *base, uint32_t address, uint8_t data[], uint32_t size,
									cy_stc_smif_context_t const *context) {
	uint32_t bufIndex;
	cy_en_smif_status_t status = CY_SMIF_BAD_PARAM;
	uint32_t timeoutUnits = context->timeout;

	if ((NULL != data) && ((address & (~CY_SMIF_CRYPTO_ADDR_MASK)) == 0UL)) {
		status = CY_SMIF_SUCCESS;
		/* Fill the output array */
		for (bufIndex = 0U; bufIndex < (size / CY_SMIF_AES128_BYTES); bufIndex++) {
			uint32_t dataIndex = bufIndex * CY_SMIF_AES128_BYTES;
			uint8_t cryptoOut[CY_SMIF_AES128_BYTES];
			uint32_t outIndex;

			/* Fill the input field */
			base->CRYPTO_INPUT0 = (uint32_t)(address + ((bufIndex * CY_SMIF_AES128_BYTES) & CY_SMIF_CRYPTO_ADDR_MASK));

			/* Start the encryption */
			base->CRYPTO_CMD &= ~SMIF_CRYPTO_CMD_START_Msk;
			base->CRYPTO_CMD = (uint32_t)(_VAL2FLD(SMIF_CRYPTO_CMD_START, CY_SMIF_CRYPTO_START));

			while ((CY_SMIF_CRYPTO_COMPLETED != _FLD2VAL(SMIF_CRYPTO_CMD_START, base->CRYPTO_CMD)) &&
				   (CY_SMIF_EXCEED_TIMEOUT != status)) {
				/* Wait until the encryption is completed and check the
				 * timeout
				 */
				status = Cy_SMIF_TimeoutRun(&timeoutUnits);
			}

			if (CY_SMIF_EXCEED_TIMEOUT == status) {
				break;
			}

			Cy_SMIF_UnPackByteArray(base->CRYPTO_OUTPUT0, &cryptoOut[CY_SMIF_CRYPTO_FIRST_WORD], true);
			Cy_SMIF_UnPackByteArray(base->CRYPTO_OUTPUT1, &cryptoOut[CY_SMIF_CRYPTO_SECOND_WORD], true);
			Cy_SMIF_UnPackByteArray(base->CRYPTO_OUTPUT2, &cryptoOut[CY_SMIF_CRYPTO_THIRD_WORD], true);
			Cy_SMIF_UnPackByteArray(base->CRYPTO_OUTPUT3, &cryptoOut[CY_SMIF_CRYPTO_FOURTH_WORD], true);

			for (outIndex = 0U; outIndex < CY_SMIF_AES128_BYTES; outIndex++) {
				data[dataIndex + outIndex] ^= cryptoOut[outIndex];
			}
		}
	}
	return (status);
}

/*******************************************************************************
 * Function Name: Cy_SMIF_CacheEnable
 ****************************************************************************//**
*
* This function is used to enable the fast cache, the slow cache or both.
*
* \param base
* Holds the base address of the SMIF block registers.
*
* \param cacheType
* Holds the type of the cache to be modified. The supported values:
*   -   \ref CY_SMIF_CACHE_SLOW
*   -   \ref CY_SMIF_CACHE_FAST
*   -   \ref CY_SMIF_CACHE_BOTH
*
*******************************************************************************/
void Cy_SMIF_CacheEnable(SMIF_Type *base, uint32_t cacheType) {
	switch (cacheType) {
		case CY_SMIF_CACHE_SLOW:
			base->SLOW_CA_CTL |= SMIF_SLOW_CA_CTL_ENABLED_Msk;
			break;
		case CY_SMIF_CACHE_FAST:
			base->FAST_CA_CTL |= SMIF_FAST_CA_CTL_ENABLED_Msk;
			break;
		case CY_SMIF_CACHE_BOTH:
			base->SLOW_CA_CTL |= SMIF_SLOW_CA_CTL_ENABLED_Msk;
			base->FAST_CA_CTL |= SMIF_FAST_CA_CTL_ENABLED_Msk;
			break;
		default:
			/* A user error*/
			break;
	}
}

