pdp7/openocd/contrib/loaders/flash/flm/cypress/psoc6/CY8C6xxx_SMIF/cy_smif/cy_smif.c
/*******************************************************************************
 * Function Name: Cy_SMIF_CacheDisable
 ****************************************************************************//**
*
* This function is used to disable the fast cache, the slow cache or both
*
* \param base
* Holds the base address of the SMIF block registers.
*
* \param cacheType
* Holds the type of the cache to be modified. The supported values:
*   -   \ref CY_SMIF_CACHE_SLOW
*   -   \ref CY_SMIF_CACHE_FAST
*   -   \ref CY_SMIF_CACHE_BOTH
*
*******************************************************************************/
void Cy_SMIF_CacheDisable(SMIF_Type *base, uint32_t cacheType) {
	switch (cacheType) {
		case CY_SMIF_CACHE_SLOW:
			base->SLOW_CA_CTL &= ~SMIF_SLOW_CA_CTL_ENABLED_Msk;
			break;
		case CY_SMIF_CACHE_FAST:
			base->FAST_CA_CTL &= ~SMIF_FAST_CA_CTL_ENABLED_Msk;
			break;
		case CY_SMIF_CACHE_BOTH:
			base->SLOW_CA_CTL &= ~SMIF_SLOW_CA_CTL_ENABLED_Msk;
			base->FAST_CA_CTL &= ~SMIF_FAST_CA_CTL_ENABLED_Msk;
			break;
		default:
			/* User error*/
			break;
	}
}

/*******************************************************************************
 * Function Name: Cy_SMIF_CachePrefetchingEnable
 ****************************************************************************//**
*
* This function is used to enable pre-fetching for the fast cache, the slow
* cache or both.
*
* \param base
* Holds the base address of the SMIF block registers.
*
* \param cacheType
* Holds the type of the cache to be modified. The supported values:
*   -   \ref CY_SMIF_CACHE_SLOW
*   -   \ref CY_SMIF_CACHE_FAST
*   -   \ref CY_SMIF_CACHE_BOTH
*
*******************************************************************************/
void Cy_SMIF_CachePrefetchingEnable(SMIF_Type *base, uint32_t cacheType) {
	switch (cacheType) {
		case CY_SMIF_CACHE_SLOW:
			base->SLOW_CA_CTL |= SMIF_SLOW_CA_CTL_PREF_EN_Msk;
			break;
		case CY_SMIF_CACHE_FAST:
			base->FAST_CA_CTL |= SMIF_FAST_CA_CTL_PREF_EN_Msk;
			break;
		case CY_SMIF_CACHE_BOTH:
			base->SLOW_CA_CTL |= SMIF_SLOW_CA_CTL_PREF_EN_Msk;
			base->FAST_CA_CTL |= SMIF_FAST_CA_CTL_PREF_EN_Msk;
			break;
		default:
			/* A user error*/
			break;
	}
}

/*******************************************************************************
 * Function Name: Cy_SMIF_CachePrefetchingDisable
 ****************************************************************************//**
*
* This function is used to disable pre-fetching for the fast cache, the slow
* cache or both
*
* \param base
* Holds the base address of the SMIF block registers.
*
* \param cacheType
* Holds the type of the cache to be modified. The supported values:
*   -    \ref CY_SMIF_CACHE_SLOW
*   -    \ref CY_SMIF_CACHE_FAST
*   -    \ref CY_SMIF_CACHE_BOTH
*
*******************************************************************************/
void Cy_SMIF_CachePrefetchingDisable(SMIF_Type *base, uint32_t cacheType) {
	switch (cacheType) {
		case CY_SMIF_CACHE_SLOW:
			base->SLOW_CA_CTL &= ~SMIF_SLOW_CA_CTL_PREF_EN_Msk;
			break;
		case CY_SMIF_CACHE_FAST:
			base->FAST_CA_CTL &= ~SMIF_FAST_CA_CTL_PREF_EN_Msk;
			break;
		case CY_SMIF_CACHE_BOTH:
			base->SLOW_CA_CTL &= ~SMIF_SLOW_CA_CTL_PREF_EN_Msk;
			base->FAST_CA_CTL &= ~SMIF_FAST_CA_CTL_PREF_EN_Msk;
			break;
		default:
			/* A user error*/
			break;
	}
}

/*******************************************************************************
 * Function Name: Cy_SMIF_CacheInvalidate
 ****************************************************************************//**
*
* This function is used to invalidate/clear the fast cache, the slow cache or
* both
*
* \param base
* Holds the base address of the SMIF block registers.
*
* \param cacheType
* Holds the type of the cache to be modified. The supported values:
*   -    \ref CY_SMIF_CACHE_SLOW
*   -    \ref CY_SMIF_CACHE_FAST
*   -    \ref CY_SMIF_CACHE_BOTH
*
*******************************************************************************/
void Cy_SMIF_CacheInvalidate(SMIF_Type *base, uint32_t cacheType) {
	switch (cacheType) {
		case CY_SMIF_CACHE_SLOW:
			base->SLOW_CA_CMD |= SMIF_SLOW_CA_CMD_INV_Msk;
			break;
		case CY_SMIF_CACHE_FAST:
			base->FAST_CA_CMD |= SMIF_FAST_CA_CMD_INV_Msk;
			break;
		case CY_SMIF_CACHE_BOTH:
			base->SLOW_CA_CMD |= SMIF_SLOW_CA_CMD_INV_Msk;
			base->FAST_CA_CMD |= SMIF_FAST_CA_CMD_INV_Msk;
			break;
		default:
			/* A user error*/
			break;
	}
}

/*******************************************************************************
 * Function Name: Cy_SMIF_DeepSleepCallback
 ****************************************************************************//**
*
* This function handles the transition of the SMIF into and out of Deep
* Sleep mode. It prevents the device from entering DeepSleep if SMIF is actively
* communicating, or there is any data in the TX or RX FIFOs, or SMIF is in
* memory mode.
*
* This function should be called while execution of \ref Cy_SysPm_DeepSleep
* therefore must be registered as a callback before the call. To register it
* call \ref Cy_SysPm_RegisterCallback and specify \ref CY_SYSPM_DEEPSLEEP
* as the callback type.
*
* \note
* This API is template and user should add code for external memory enter/exit
* low power mode.
*
* \param callbackParams
* The pointer to the structure with SMIF SysPm callback parameters (pointer to
* SMIF registers, context and call mode \ref cy_stc_syspm_callback_params_t).
*
* \return
* \ref cy_en_syspm_status_t
*
* Example setup of SysPM deep sleep and hibernate mode
* \snippet smif/smif_sut_01.cydsn/main_cm4.c SMIF SysPM Callback
*
*******************************************************************************/
cy_en_syspm_status_t Cy_SMIF_DeepSleepCallback(cy_stc_syspm_callback_params_t *callbackParams) {
	cy_en_syspm_status_t retStatus = CY_SYSPM_SUCCESS;

	SMIF_Type *locBase = (SMIF_Type *)callbackParams->base;
	cy_stc_smif_context_t *locContext = (cy_stc_smif_context_t *)callbackParams->context;

	switch (callbackParams->mode) {
		case CY_SYSPM_CHECK_READY: {
			/* Check if API is not busy executing transfer operation */
			/* If SPI bus is not busy, all data elements are transferred on
			 * the bus from the TX FIFO and shifter and the RX FIFIOs is
			 * empty - the SPI is ready enter Deep Sleep.
			 */
			bool checkFail = (CY_SMIF_REC_BUSY == (cy_en_smif_txfr_status_t)Cy_SMIF_GetTxfrStatus(locBase, locContext));
			checkFail = (Cy_SMIF_BusyCheck(locBase)) || checkFail;
			checkFail = (Cy_SMIF_GetMode(locBase) == CY_SMIF_MEMORY) || checkFail;

			if (checkFail) {
				retStatus = CY_SYSPM_FAIL;
			} else {
				Cy_SMIF_Disable(locBase);
				retStatus = CY_SYSPM_SUCCESS;
			}
			/* Add check memory that memory not in progress */
		} break;

		case CY_SYSPM_CHECK_FAIL: {
			/* Other driver is not ready for Deep Sleep. Restore Active mode
			 * configuration.
			 */
			Cy_SMIF_Enable(locBase, locContext);

